[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.postimg.cc/6QRyMSVb/book1.png",
        "review": "To Kill a Mockingbird is a poignant exploration of racial injustice and moral growth in a small Southern town. Through the innocent eyes of Scout Finch, the daughter of lawyer Atticus Finch, readers witness the deep-rooted prejudices and societal norms that plague Maycomb. Harper Lee masterfully crafts characters and situations that challenge conventional wisdom, inviting readers to reflect on their own beliefs and values. This timeless classic continues to resonate with audiences, reminding us of the enduring power of empathy and compassion.",
        "totalPages": 281,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Coming of Age", "Southern Literature"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.postimg.cc/zvPzzSSR/book2.png",
        "review": "1984 presents a chilling dystopian vision of a totalitarian society where individuality is suppressed, and truth is manipulated by the ruling Party. George Orwell's prophetic novel warns against the dangers of unchecked government surveillance and propaganda, depicting a world where Big Brother watches every move and thought. Through the protagonist Winston Smith's rebellion and eventual submission, readers confront the consequences of apathy and conformity. With its stark portrayal of oppression and thought control, 1984 remains a haunting reminder of the fragility of freedom and the power of authoritarianism.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Dystopian",
        "tags": ["Political", "Social Commentary"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.postimg.cc/260mGFtX/book3.png",
        "review": "The Great Gatsby is a captivating tale of love, ambition, and the elusive American Dream set amidst the opulence of the Jazz Age. F. Scott Fitzgerald's exquisite prose paints a vivid portrait of Jay Gatsby, a mysterious millionaire, and his obsession with Daisy Buchanan, a woman from his past. Through the eyes of narrator Nick Carraway, readers are drawn into a world of excess and disillusionment, where wealth masks inner emptiness and moral decay. As Gatsby's extravagant parties unfold, so too does the tragic unraveling of his dreams. This timeless classic explores themes of identity, longing, and the fleeting nature of happiness.",
        "totalPages": 180,
        "rating": 4.3,
        "category": "Literary Fiction",
        "tags": ["Romance", "Social Critique"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.postimg.cc/CLqTngw2/book4.png",
        "review": "Pride and Prejudice is a timeless romantic comedy that delights readers with its wit, charm, and social commentary. Jane Austen's iconic novel follows the spirited Elizabeth Bennet as she navigates the intricacies of love and class in early 19th-century England. From the memorable encounters with the enigmatic Mr. Darcy to the humorous exchanges within the Bennet family, Austen's keen observations of human nature shine through. Through its exploration of pride, prejudice, and the power of first impressions, this beloved classic continues to enchant readers of all ages, reminding us that true love often defies expectations.",
        "totalPages": 279,
        "rating": 4.4,
        "category": "Romance",
        "tags": ["Regency Era", "Satire"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.postimg.cc/vmXpw8v4/book5.png",
        "review": "The Catcher in the Rye is a provocative coming-of-age novel that captures the disillusionment and alienation of adolescence in post-war America. J.D. Salinger's protagonist, Holden Caulfield, rebels against the phoniness and hypocrisy of adult society as he embarks on a journey of self-discovery in New York City. Through Holden's candid and irreverent voice, readers confront themes of identity, authenticity, and the loss of innocence. Salinger's portrayal of teenage angst and existential angst continues to resonate with readers, making The Catcher in the Rye a timeless classic that transcends generations.",
        "totalPages": 224,
        "rating": 4.2,
        "category": "Coming of Age",
        "tags": ["American Literature", "Existentialism"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "Moby-Dick",
        "author": "Herman Melville",
        "image": "https://i.postimg.cc/RqrYLWvD/book6.png",
        "review": "Moby-Dick is an epic tale of obsession, revenge, and the relentless pursuit of an enigmatic white whale. Herman Melville's magnum opus follows the journey of Captain Ahab aboard the whaling ship Pequod as he seeks vengeance against the elusive Moby Dick, the creature that maimed him. Through vivid descriptions of life at sea and philosophical musings on fate and destiny, Melville explores themes of madness, fate, and the nature of evil. Moby-Dick's rich symbolism and poetic language have cemented its status as one of the greatest American novels ever written, captivating readers with its timeless exploration of the human condition.",
        "totalPages": 624,
        "rating": 4.1,
        "category": "Adventure",
        "tags": ["Nautical Fiction", "Symbolism"],
        "publisher": "Richard Bentley (UK), Harper & Brothers (US)",
        "yearOfPublishing": 1851
    },
    {
        "bookId": 7,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.postimg.cc/3N2s6XfT/book7.png",
        "review": "The Lord of the Rings is a sweeping epic of courage, friendship, and the battle between good and evil set in the fantastical world of Middle-earth. J.R.R. Tolkien's masterpiece follows the quest of hobbit Frodo Baggins to destroy the One Ring and defeat the dark lord Sauron. Alongside a diverse fellowship including elves, dwarves, men, and wizards, Frodo faces perilous challenges and discovers the true meaning of heroism. Tolkien's richly imagined world, intricate mythology, and timeless themes of sacrifice and redemption have captivated readers for generations, solidifying The Lord of the Rings as a landmark achievement in fantasy literature.",
        "totalPages": 1178,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["High Fantasy", "Adventure"],
        "publisher": "George Allen & Unwin (UK), Houghton Mifflin (US)",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 8,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.postimg.cc/htDky79k/book8.png",
        "review": "The Hobbit is a charming and whimsical tale of adventure and discovery set in the enchanting world of Middle-earth. J.R.R. Tolkien's classic follows the journey of hobbit Bilbo Baggins as he is swept away from his comfortable home on a quest to reclaim the lost kingdom of Erebor. Alongside a band of dwarves and the wizard Gandalf, Bilbo encounters trolls, goblins, and a fearsome dragon named Smaug. Through courage and cunning, Bilbo proves himself a hero and discovers reserves of strength he never knew he possessed. With its delightful characters, thrilling escapades, and themes of bravery and friendship, The Hobbit continues to enchant readers of all ages.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Children's Literature",
        "tags": ["Adventure", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 9,
        "bookName": "Frankenstein",
        "author": "Mary Shelley",
        "image": "https://i.postimg.cc/6qxSd7W1/book9.png",
        "review": "Frankenstein is a haunting tale of ambition, hubris, and the consequences of playing god. Mary Shelley's seminal novel follows Victor Frankenstein, a young scientist who creates a grotesque creature through a secret experiment. As the creature grapples with his own identity and seeks acceptance in a hostile world, Victor wrestles with guilt and remorse over his creation. Shelley's exploration of the ethics of science and the nature of humanity remains as relevant today as it was in 1818 when the novel was first published. Through its themes of alienation, prejudice, and the pursuit of knowledge, Frankenstein continues to captivate readers and provoke thought.",
        "totalPages": 280,
        "rating": 4.4,
        "category": "Gothic Fiction",
        "tags": ["Science Fiction", "Horror"],
        "publisher": "Lackington, Hughes, Harding, Mavor, & Jones",
        "yearOfPublishing": 1818
    }
]
